{
  "irVersion": "1.0",
  "source": "examples/calc.expr",
  "nodes": [
    {
      "id": "n0",
      "kind": "Root",
      "span": { "start": 0, "end": 1 }
    }
  ],
  "scopeEvents": [
    {
      "event": "enteringScope",
      "scopeId": "s0",
      "span": { "start": 0, "end": 1 }
    }
  ],
  "diagnostics": []
}
