{
  "irVersion": "1.0",
  "source": "examples/calc.expr",
  "nodes": [
    {
      "id": "n0",
      "kind": "Root",
      "span": { "start": 0, "end": 1 }
    }
  ],
  "annotations": [
    {
      "targetId": "n999",
      "name": "mapping",
      "payload": {
        "nodeType": "ExprNode"
      }
    }
  ],
  "diagnostics": []
}
