{
  "irVersion": "1.0",
  "source": "examples/calc.expr",
  "nodes": [
    {
      "id": "n0",
      "kind": "Root",
      "span": { "start": 0, "end": 5 }
    }
  ],
  "diagnostics": [
    {
      "code": "W-SYMBOL-SHADOWING",
      "severity": "WARNING",
      "span": { "start": 0, "end": 1 },
      "message": "shadowing"
    },
    {
      "code": "W-SYMBOL-SHADOWING",
      "severity": "WARNING",
      "span": { "start": 0, "end": 1 },
      "message": "shadowing"
    }
  ]
}
