{
  "irVersion": "1.0",
  "source": "sample.ubnf",
  "nodes": [
    {
      "id": "Expr",
      "kind": "RuleDecl",
      "span": {
        "start": 0,
        "end": 10
      }
    }
  ],
  "diagnostics": [],
  "scopeEvents": [
    {
      "event": "enterScope",
      "scopeId": "s1",
      "span": {
        "start": 0,
        "end": 0
      }
    },
    {
      "event": "enterScope",
      "scopeId": "s2",
      "span": {
        "start": 1,
        "end": 1
      }
    },
    {
      "event": "leaveScope",
      "scopeId": "s1",
      "span": {
        "start": 2,
        "end": 2
      }
    },
    {
      "event": "leaveScope",
      "scopeId": "s2",
      "span": {
        "start": 3,
        "end": 3
      }
    }
  ]
}
