{
  "irVersion": "1.0",
  "source": "examples/calc.expr",
  "nodes": [
    {
      "id": "n0",
      "kind": "Root",
      "span": { "start": 0, "end": 3 },
      "children": ["n1"]
    },
    {
      "id": "n1",
      "kind": "Number",
      "span": { "start": 0, "end": 1 },
      "parentId": "n2"
    },
    {
      "id": "n2",
      "kind": "AltRoot",
      "span": { "start": 0, "end": 3 }
    }
  ],
  "diagnostics": []
}
