{
  "irVersion": "1.0",
  "source": "examples/calc.expr",
  "nodes": [
    {
      "id": "n0",
      "kind": "Root",
      "span": { "start": 0, "end": 2 }
    }
  ],
  "scopeEvents": [
    { "event": "enterScope", "scopeId": "s0", "span": { "start": 0, "end": 2 } },
    {
      "event": "use",
      "scopeId": "s0",
      "span": { "start": 0, "end": 1 },
      "symbol": "x",
      "targetScopeId": "s999"
    },
    { "event": "leaveScope", "scopeId": "s0", "span": { "start": 0, "end": 2 } }
  ],
  "diagnostics": []
}
