{
  "irVersion": "1.0",
  "source": "examples/calc.expr",
  "nodes": [
    {
      "id": "n0",
      "kind": "Root",
      "span": { "start": 0, "end": 2 },
      "children": ["n1", "n1"]
    },
    {
      "id": "n1",
      "kind": "Number",
      "span": { "start": 0, "end": 1 },
      "parentId": "n0"
    }
  ],
  "diagnostics": []
}
