{
  "irVersion": "1.0",
  "source": "examples/calc.expr",
  "nodes": [
    {
      "id": "n0",
      "kind": "Root",
      "span": { "start": 0, "end": 7 },
      "children": ["n1", "n2", "n3"],
      "attributes": { "rule": "Expr" }
    },
    {
      "id": "n1",
      "kind": "Ident",
      "span": { "start": 0, "end": 1 },
      "parentId": "n0",
      "text": "x"
    },
    {
      "id": "n2",
      "kind": "OpPlus",
      "span": { "start": 2, "end": 3 },
      "parentId": "n0",
      "text": "+"
    },
    {
      "id": "n3",
      "kind": "Number",
      "span": { "start": 4, "end": 5 },
      "parentId": "n0",
      "text": "1"
    }
  ],
  "tokens": [
    { "kind": "IDENT", "span": { "start": 0, "end": 1 }, "text": "x" },
    { "kind": "PLUS", "span": { "start": 2, "end": 3 }, "text": "+" },
    { "kind": "NUMBER", "span": { "start": 4, "end": 5 }, "text": "1" }
  ],
  "trivia": [
    { "kind": "WS", "span": { "start": 1, "end": 2 }, "text": " " },
    { "kind": "WS", "span": { "start": 3, "end": 4 }, "text": " " }
  ],
  "scopeEvents": [
    { "event": "enterScope", "scopeId": "s0", "scopeMode": "lexical", "span": { "start": 0, "end": 7 } },
    {
      "event": "define",
      "scopeId": "s0",
      "span": { "start": 0, "end": 1 },
      "symbol": "x",
      "kind": "variable"
    },
    {
      "event": "use",
      "scopeId": "s0",
      "span": { "start": 0, "end": 1 },
      "symbol": "x",
      "targetScopeId": "s0"
    },
    { "event": "leaveScope", "scopeId": "s0", "scopeMode": "lexical", "span": { "start": 0, "end": 7 } }
  ],
  "annotations": [
    {
      "targetId": "n0",
      "name": "mapping",
      "payload": {
        "nodeType": "ExprNode"
      }
    }
  ],
  "diagnostics": [
    {
      "code": "W-SYMBOL-SHADOWING",
      "severity": "WARNING",
      "span": { "start": 0, "end": 1 },
      "message": "symbol 'x' shadows outer scope",
      "hint": "rename symbol for clarity",
      "related": [
        {
          "span": { "start": 6, "end": 7 },
          "message": "outer declaration here"
        }
      ]
    }
  ]
}
